3B/SE464/src/14-Architecture-Styles.org
#+title: Architecture Styles
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="src/latex.css" />

* Architectures
No good way to characterize architectural structures, but best to make common use of architectural
principles when designing software.
Principles represent rules of thumb or emerging patterns, or industry standards.

* Architecture Styles of Software Systems
*Architectural Style*: family of systems in terms of a pattern of structural organization

Architectural style determines:
- *vocabulary* of components and connectors that can be used in instances of that style
- *constraints* on how they can be combined
  - constraints of topology of descriptions or execution semantics

To determine an architectural style, determine:
- _structural pattern_ (components, connectors, constraints)
- underlying _computational model_
- essential _invariants_
- _examples_ of use
- _advantages and disadvantages_ of use
- common _specializations_ of style

System architecture is collection of computational components and description of interactions between
components (connectors).

Software architectures are represented as graphs where _nodes_ represent components: procedures, modules,
processes, tools, and DBs; and _edges_ represent connectors: procedure calls, event broadcasts.
DB queries, and pipes.

** Repository Style
Suitable for applications in which central issue is establishing, augmenting, and maintaining a
complex _central body of info_.

Typically, info must be manipulated in a variety of ways, so long-term persistence is required.

_Components_:
- central data structure representing current system state
- collection of independent components that operate on central data structure

_Connectors_:
- procedure calls or direct memory access

Changes to data structure trigger computation.

Data structure in memory and on disk.

Concurrent computations and data accesses.

Multiple clients collaborate, accessing data, processing it, and updating it for others to process
further.

Examples include programming environments, info systems, graphical editors, and AI knowledge
bases.

_Advantages_:
- efficient way to store large amounts of data
- sharing model published as the repository schema
- centralized management: backup, security, concurrency control

_Disadvantages_:
- must agree on data model beforehand
- difficult to distribute data
- data evolution is expensive

** Pipe and Filter Style
Suitable for applications that require defined series of independent computations to be performed on
data.

Component reads _streams_ of data as input and produces streams of data as output.

_Components_:
- *filters*: apply local transformations to input streams and compute incrementally so output begins
  before all input consumed

_Connectors_:
- *pipes*: conduits for streams, transmitting outputs of 1 filter to inputs of another filter

Filters do not share state with other filters.
Filters do not know identity of their upstream or downstream filters.

_Advantages_:
- easy to understand overall input/output behaviour of system as composition of behaviours of
  individual filters
- support reuse since any 2 filters can be hooked together provided they agree on data transmitted
  between them
- easy to maintain and enhance (add new filters and replace old filters easily)
- permit specialized analysis (throughput and deadlock analysis)
- support concurrent execution

_Disadvantages_:
- bad for interactive systems due to transformational character
- excessive parsing and unparsing leads to loss of performance and increased complexity in
  writing filters

*** Specializations
*Pipelines*: restricts topologies to linear sequences of filters

*Batch Sequential*: degenerate case of pipeline architecture where each filter processes all
input data before producing any output

Compilers started with sequential process and moved towards repository as intermediate
representation became more important.

** Object-Oriented
Suitable for applications in which a central issue is identifying and protecting related bodies
of info (data).

Data representations and associated operations are encapsulated in abstract data types.

_Components_: objects

_Connectors_: function and procedure invocations (methods)

Objects are responsible for preserving integrity (invariants) of data representation.

Data representation is hidden from other objects.

Specializations include distributed objects and objects with multiple interfaces.

_Advantages_:
- object hides data representation from clients, so possible to change implementation without
  affecting clients
- can design systems as collections of autonomous interacting agents

_Disadvantages_:
- for 1 object to interact with another object (via method invocation), first object must know
  _identity_ of second object
  - when identity changes, must modify all objects that invoke it
- objects cause side effect problems, especially when object used by multiple different objects

