3B/SE464/14-Architecture-Styles.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-11 Wed 05:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Architecture Styles</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Architecture Styles</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0692068">1. Architectures</a></li>
<li><a href="#org5df91a9">2. Architecture Styles of Software Systems</a>
<ul>
<li><a href="#orga1369f0">2.1. Repository Style</a></li>
<li><a href="#org011190f">2.2. Pipe and Filter Style</a>
<ul>
<li><a href="#org8c7a255">2.2.1. Specializations</a></li>
</ul>
</li>
<li><a href="#org281e452">2.3. Object-Oriented</a></li>
<li><a href="#org58e0951">2.4. Layered</a>
<ul>
<li><a href="#org443dbcf">2.4.1. Specializations</a></li>
</ul>
</li>
<li><a href="#orgf873652">2.5. Interpreter</a></li>
<li><a href="#orgedf5407">2.6. Process-Control</a>
<ul>
<li><a href="#orgbfc3325">2.6.1. Feedback Control System</a></li>
<li><a href="#org8031e41">2.6.2. Open-Loop Control System</a></li>
</ul>
</li>
<li><a href="#orga212bd8">2.7. Client-Server</a></li>
<li><a href="#orgc264ff6">2.8. Peer-to-Peer</a></li>
<li><a href="#org1d98ac0">2.9. Implicit Invocation Style</a>
<ul>
<li><a href="#orgbcffefd">2.9.1. Specializations</a></li>
</ul>
</li>
<li><a href="#org1b4dbcf">2.10. Event Driven Architecture</a>
<ul>
<li><a href="#org8a52e1f">2.10.1. Publisher-Subscriber</a></li>
<li><a href="#orgee4a316">2.10.2. Asynchronous Messaging Subsystem</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0692068" class="outline-2">
<h2 id="org0692068"><span class="section-number-2">1.</span> Architectures</h2>
<div class="outline-text-2" id="text-1">
<p>
No good way to characterize architectural structures, but best to make common use of architectural
principles when designing software.
Principles represent rules of thumb or emerging patterns, or industry standards.
</p>
</div>
</div>
<div id="outline-container-org5df91a9" class="outline-2">
<h2 id="org5df91a9"><span class="section-number-2">2.</span> Architecture Styles of Software Systems</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Architectural Style</b>: family of systems in terms of a pattern of structural organization
</p>

<p>
Architectural style determines:
</p>
<ul class="org-ul">
<li><b>vocabulary</b> of components and connectors that can be used in instances of that style</li>
<li><b>constraints</b> on how they can be combined
<ul class="org-ul">
<li>constraints of topology of descriptions or execution semantics</li>
</ul></li>
</ul>

<p>
To determine an architectural style, determine:
</p>
<ul class="org-ul">
<li><span class="underline">structural pattern</span> (components, connectors, constraints)</li>
<li>underlying <span class="underline">computational model</span></li>
<li>essential <span class="underline">invariants</span></li>
<li><span class="underline">examples</span> of use</li>
<li><span class="underline">advantages and disadvantages</span> of use</li>
<li>common <span class="underline">specializations</span> of style</li>
</ul>

<p>
System architecture is collection of computational components and description of interactions between
components (connectors).
</p>

<p>
Software architectures are represented as graphs where <span class="underline">nodes</span> represent components: procedures, modules,
processes, tools, and DBs; and <span class="underline">edges</span> represent connectors: procedure calls, event broadcasts.
DB queries, and pipes.
</p>
</div>
<div id="outline-container-orga1369f0" class="outline-3">
<h3 id="orga1369f0"><span class="section-number-3">2.1.</span> Repository Style</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Suitable for applications in which central issue is establishing, augmenting, and maintaining a
complex <span class="underline">central body of info</span>.
</p>

<p>
Typically, info must be manipulated in a variety of ways, so long-term persistence is required.
</p>

<p>
<span class="underline">Components</span>:
</p>
<ul class="org-ul">
<li>central data structure representing current system state</li>
<li>collection of independent components that operate on central data structure</li>
</ul>

<p>
<span class="underline">Connectors</span>:
</p>
<ul class="org-ul">
<li>procedure calls or direct memory access</li>
</ul>

<p>
Changes to data structure trigger computation.
</p>

<p>
Data structure in memory and on disk.
</p>

<p>
Concurrent computations and data accesses.
</p>

<p>
Multiple clients collaborate, accessing data, processing it, and updating it for others to process
further.
</p>

<p>
Examples include programming environments, info systems, graphical editors, and AI knowledge
bases.
</p>

<p>
<span class="underline">Advantages</span>:
</p>
<ul class="org-ul">
<li>efficient way to store large amounts of data</li>
<li>sharing model published as the repository schema</li>
<li>centralized management: backup, security, concurrency control</li>
</ul>

<p>
<span class="underline">Disadvantages</span>:
</p>
<ul class="org-ul">
<li>must agree on data model beforehand</li>
<li>difficult to distribute data</li>
<li>data evolution is expensive</li>
</ul>
</div>
</div>
<div id="outline-container-org011190f" class="outline-3">
<h3 id="org011190f"><span class="section-number-3">2.2.</span> Pipe and Filter Style</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Suitable for applications that require defined series of independent computations to be performed on
data.
</p>

<p>
Component reads <span class="underline">streams</span> of data as input and produces streams of data as output.
</p>

<p>
<span class="underline">Components</span>:
</p>
<ul class="org-ul">
<li><b>filters</b>: apply local transformations to input streams and compute incrementally so output begins
before all input consumed</li>
</ul>

<p>
<span class="underline">Connectors</span>:
</p>
<ul class="org-ul">
<li><b>pipes</b>: conduits for streams, transmitting outputs of 1 filter to inputs of another filter</li>
</ul>

<p>
Filters do not share state with other filters.
Filters do not know identity of their upstream or downstream filters.
</p>

<p>
<span class="underline">Advantages</span>:
</p>
<ul class="org-ul">
<li>easy to understand overall input/output behaviour of system as composition of behaviours of
individual filters</li>
<li>support reuse since any 2 filters can be hooked together provided they agree on data transmitted
between them</li>
<li>easy to maintain and enhance (add new filters and replace old filters easily)</li>
<li>permit specialized analysis (throughput and deadlock analysis)</li>
<li>support concurrent execution</li>
</ul>

<p>
<span class="underline">Disadvantages</span>:
</p>
<ul class="org-ul">
<li>bad for interactive systems due to transformational character</li>
<li>excessive parsing and unparsing leads to loss of performance and increased complexity in
writing filters</li>
</ul>
</div>
<div id="outline-container-org8c7a255" class="outline-4">
<h4 id="org8c7a255"><span class="section-number-4">2.2.1.</span> Specializations</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
<b>Pipelines</b>: restricts topologies to linear sequences of filters
</p>

<p>
<b>Batch Sequential</b>: degenerate case of pipeline architecture where each filter processes all
input data before producing any output
</p>

<p>
Compilers started with sequential process and moved towards repository as intermediate
representation became more important.
</p>
</div>
</div>
</div>
<div id="outline-container-org281e452" class="outline-3">
<h3 id="org281e452"><span class="section-number-3">2.3.</span> Object-Oriented</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Suitable for applications in which a central issue is identifying and protecting related bodies
of info (data).
</p>

<p>
Data representations and associated operations are encapsulated in abstract data types.
</p>

<p>
<span class="underline">Components</span>: objects
</p>

<p>
<span class="underline">Connectors</span>: function and procedure invocations (methods)
</p>

<p>
Objects are responsible for preserving integrity (invariants) of data representation.
</p>

<p>
Data representation is hidden from other objects.
</p>

<p>
Specializations include distributed objects and objects with multiple interfaces.
</p>

<p>
<span class="underline">Advantages</span>:
</p>
<ul class="org-ul">
<li>object hides data representation from clients, so possible to change implementation without
affecting clients</li>
<li>can design systems as collections of autonomous interacting agents</li>
</ul>

<p>
<span class="underline">Disadvantages</span>:
</p>
<ul class="org-ul">
<li>for 1 object to interact with another object (via method invocation), first object must know
<span class="underline">identity</span> of second object
<ul class="org-ul">
<li>when identity changes, must modify all objects that invoke it</li>
</ul></li>
<li>objects cause side effect problems, especially when object used by multiple different objects</li>
</ul>
</div>
</div>
