3B/SE464/src/14-Architecture-Styles.org
** Layered
Suitable for applications that involve distinct classes of services that can be
_organized hierarchically_.

Each layer provides service to the layer above and serves as client to layer below.

Only carefully selected procedures from inner layers are made available (exported) to adjacent
outer layer.

_Components_: collections of procedures

_Connectors_: procedure calls under restricted visibility

Tier is _physical_ partition of system across servers, layer is _logical_ partition of related
functionality, typically at different layers of abstraction.

_Advantages_:
- design based on increasing levels of abstraction
- enhancement easy since changes to one layer affects at most 2 other layers
- allows reuse since different implementations of same layer can be used interchangeably

_Disadvantages_:
- not all systems are easily structured in layered fashion
- performance requirements may force coupling of high-level functions to lower-level implementations

*** Specializations
Exceptions are made to permit non-adjacent layers to communicate directly, done for
efficiency reasons.

** Interpreter
Suitable for applications in which the most appropriate language or machine.

_Components_: include one state machine for the execution engine and 3 memories:
- current state of the execution engine
- program being interpreted
- current state of the program being interpreted

_Connectors_:
- procedure calls
- direct memory accesses

_Advantages_:
- simulation of non-implemented hardware
- facilitates portability of application or languages across
  a variety of platforms

_Disadvantages_:
- defining, implementing, and testing interpreter components
  is non-trivial
- extra level of indirection slows down execution:

** Process-Control
Suitable for applications whose purpose is to maintain
specified properties of the outputs of the process sufficiently
near given reference values.

_Components_:
- process definition includes mechanisms for manipulating process
  variables
- control algorithm for deciding how to manipulate process
  variables

_Connectors_: data flow relations for
- *process variables*: controlled variables whose value the system
  is intended to control
  - input variable that measures process input
  - manipulated variable whose value can be changed by the controller
- *set point*: desired value for a controlled variable
- *sensors*: obtain values of process variables to control

*** Feedback Control System
Controlled variable is measured and result is used to manipulate
1+ process variables.

*** Open-Loop Control System
Given pure input materials, fully defined process, and completely
repeatable process, process can run without surveillance (no
feedback).

Info about process variables is not used to adjust system.

** Client-Server
Suitable for applications that involve _distributed data_ and processing
across a range of components.

_Components_:
- *server*: standalone component that provides specific services
- *client*: component that call on the services provided by servers

_Connector_: network, which allows clients to access remote servers

_Advantages_:
- straightforward distribution of data
- transparency of location
- mix/match heterogeneous platforms
- easy to add new servers or upgrade existing servers

_Disadvantages_:
- system performance depends on network performance
- tricky to design and implement client/server systems
- hard to find out what services are available

** Peer-to-Peer
Suitable for applications that partition tasks/workloads between peers
_without centralized control_.

_Components_:
- peers: standalone components that provide specific services to each
  other (act as both client and server)

_Connector_: some kind of network that allows peers to access each other
directly without a central server

Connections can be transient/ad hoc.

_Advantages_:
- no single point of failure (since no central server)
- resilient against network issues or failing peer by establishing
  new links to other peers
- scalable (since no central server)
- more privacy (in theory)
- easy to add new peers or upgrade existing peers

_Disadvantages_:
- cliques of peers could be disconnected from each other if no overlapping
  peer
- requires continuous exchange of lists of known peers between each peer
- could require central directory server to be able to locate each peer
- no guaranteed response from peers (could be down, delayed, hostile)

** Implicit Invocation Style
Suitable for applications that involve loosely-coupled collection of
components, each of which carries out some operation and may in the
process enable other operations.

Useful for applications that must be reconfigured on the fly.

Instead of invoking a procedure directly:
- a *component* announces/broadcasts 1+ events
- other components register interest in an event by associating a
  procedure with the event
- when an event is announced, broadcasting system (*connector*)
  itself invokes all procedures that have been registered for the
  event

Announcers of events do not know which components will be affected
by those events.

Components cannot make assumptions about the order of processing.

Components cannot make assumptions about what processing will occur
as a result of their events (perhaps no component responds).

_Advantages_:
- strong support for reuse since any component can be introduced
  into a system simply by registering it for the event of
  that system
- eases system evolution since components may be replaced without
  affecting interfaces of other components in the system

_Disadvantages_:
- when component announces events
  - unknown what components will respond
  - unknown order of responses
  - unknown when responses are finished

*** Specializations
Often connectors include the traditional procedure call in addition to
bindings between event announcements and procedure calls.

