3B/SE464/14-Architecture-Styles.html
<div id="outline-container-org58e0951" class="outline-3">
<h3 id="org58e0951"><span class="section-number-3">2.4.</span> Layered</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Suitable for applications that involve distinct classes of services that can be
<span class="underline">organized hierarchically</span>.
</p>

<p>
Each layer provides service to the layer above and serves as client to layer below.
</p>

<p>
Only carefully selected procedures from inner layers are made available (exported) to adjacent
outer layer.
</p>

<p>
<span class="underline">Components</span>: collections of procedures
</p>

<p>
<span class="underline">Connectors</span>: procedure calls under restricted visibility
</p>

<p>
Tier is <span class="underline">physical</span> partition of system across servers, layer is <span class="underline">logical</span> partition of related
functionality, typically at different layers of abstraction.
</p>

<p>
<span class="underline">Advantages</span>:
</p>
<ul class="org-ul">
<li>design based on increasing levels of abstraction</li>
<li>enhancement easy since changes to one layer affects at most 2 other layers</li>
<li>allows reuse since different implementations of same layer can be used interchangeably</li>
</ul>

<p>
<span class="underline">Disadvantages</span>:
</p>
<ul class="org-ul">
<li>not all systems are easily structured in layered fashion</li>
<li>performance requirements may force coupling of high-level functions to lower-level implementations</li>
</ul>
</div>
<div id="outline-container-org443dbcf" class="outline-4">
<h4 id="org443dbcf"><span class="section-number-4">2.4.1.</span> Specializations</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
Exceptions are made to permit non-adjacent layers to communicate directly, done for
efficiency reasons.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf873652" class="outline-3">
<h3 id="orgf873652"><span class="section-number-3">2.5.</span> Interpreter</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Suitable for applications in which the most appropriate language or machine.
</p>

<p>
<span class="underline">Components</span>: include one state machine for the execution engine and 3 memories:
</p>
<ul class="org-ul">
<li>current state of the execution engine</li>
<li>program being interpreted</li>
<li>current state of the program being interpreted</li>
</ul>

<p>
<span class="underline">Connectors</span>:
</p>
<ul class="org-ul">
<li>procedure calls</li>
<li>direct memory accesses</li>
</ul>

<p>
<span class="underline">Advantages</span>:
</p>
<ul class="org-ul">
<li>simulation of non-implemented hardware</li>
<li>facilitates portability of application or languages across
a variety of platforms</li>
</ul>

<p>
<span class="underline">Disadvantages</span>:
</p>
<ul class="org-ul">
<li>defining, implementing, and testing interpreter components
is non-trivial</li>
<li>extra level of indirection slows down execution:</li>
</ul>
</div>
</div>
<div id="outline-container-orgedf5407" class="outline-3">
<h3 id="orgedf5407"><span class="section-number-3">2.6.</span> Process-Control</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Suitable for applications whose purpose is to maintain
specified properties of the outputs of the process sufficiently
near given reference values.
</p>

<p>
<span class="underline">Components</span>:
</p>
<ul class="org-ul">
<li>process definition includes mechanisms for manipulating process
variables</li>
<li>control algorithm for deciding how to manipulate process
variables</li>
</ul>

<p>
<span class="underline">Connectors</span>: data flow relations for
</p>
<ul class="org-ul">
<li><b>process variables</b>: controlled variables whose value the system
is intended to control
<ul class="org-ul">
<li>input variable that measures process input</li>
<li>manipulated variable whose value can be changed by the controller</li>
</ul></li>
<li><b>set point</b>: desired value for a controlled variable</li>
<li><b>sensors</b>: obtain values of process variables to control</li>
</ul>
</div>
<div id="outline-container-orgbfc3325" class="outline-4">
<h4 id="orgbfc3325"><span class="section-number-4">2.6.1.</span> Feedback Control System</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
Controlled variable is measured and result is used to manipulate
1+ process variables.
</p>
</div>
</div>
<div id="outline-container-org8031e41" class="outline-4">
<h4 id="org8031e41"><span class="section-number-4">2.6.2.</span> Open-Loop Control System</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
Given pure input materials, fully defined process, and completely
repeatable process, process can run without surveillance (no
feedback).
</p>

<p>
Info about process variables is not used to adjust system.
</p>
</div>
</div>
</div>
<div id="outline-container-orga212bd8" class="outline-3">
<h3 id="orga212bd8"><span class="section-number-3">2.7.</span> Client-Server</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Suitable for applications that involve <span class="underline">distributed data</span> and processing
across a range of components.
</p>

<p>
<span class="underline">Components</span>:
</p>
<ul class="org-ul">
<li><b>server</b>: standalone component that provides specific services</li>
<li><b>client</b>: component that call on the services provided by servers</li>
</ul>

<p>
<span class="underline">Connector</span>: network, which allows clients to access remote servers
</p>

<p>
<span class="underline">Advantages</span>:
</p>
<ul class="org-ul">
<li>straightforward distribution of data</li>
<li>transparency of location</li>
<li>mix/match heterogeneous platforms</li>
<li>easy to add new servers or upgrade existing servers</li>
</ul>

<p>
<span class="underline">Disadvantages</span>:
</p>
<ul class="org-ul">
<li>system performance depends on network performance</li>
<li>tricky to design and implement client/server systems</li>
<li>hard to find out what services are available</li>
</ul>
</div>
</div>
<div id="outline-container-orgc264ff6" class="outline-3">
<h3 id="orgc264ff6"><span class="section-number-3">2.8.</span> Peer-to-Peer</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Suitable for applications that partition tasks/workloads between peers
<span class="underline">without centralized control</span>.
</p>

<p>
<span class="underline">Components</span>:
</p>
<ul class="org-ul">
<li>peers: standalone components that provide specific services to each
other (act as both client and server)</li>
</ul>

<p>
<span class="underline">Connector</span>: some kind of network that allows peers to access each other
directly without a central server
</p>

<p>
Connections can be transient/ad hoc.
</p>

<p>
<span class="underline">Advantages</span>:
</p>
<ul class="org-ul">
<li>no single point of failure (since no central server)</li>
<li>resilient against network issues or failing peer by establishing
new links to other peers</li>
<li>scalable (since no central server)</li>
<li>more privacy (in theory)</li>
<li>easy to add new peers or upgrade existing peers</li>
</ul>

<p>
<span class="underline">Disadvantages</span>:
</p>
<ul class="org-ul">
<li>cliques of peers could be disconnected from each other if no overlapping
peer</li>
<li>requires continuous exchange of lists of known peers between each peer</li>
<li>could require central directory server to be able to locate each peer</li>
<li>no guaranteed response from peers (could be down, delayed, hostile)</li>
</ul>
</div>
</div>
<div id="outline-container-org1d98ac0" class="outline-3">
<h3 id="org1d98ac0"><span class="section-number-3">2.9.</span> Implicit Invocation Style</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Suitable for applications that involve loosely-coupled collection of
components, each of which carries out some operation and may in the
process enable other operations.
</p>

<p>
Useful for applications that must be reconfigured on the fly.
</p>

<p>
Instead of invoking a procedure directly:
</p>
<ul class="org-ul">
<li>a <b>component</b> announces/broadcasts 1+ events</li>
<li>other components register interest in an event by associating a
procedure with the event</li>
<li>when an event is announced, broadcasting system (<b>connector</b>)
itself invokes all procedures that have been registered for the
event</li>
</ul>

<p>
Announcers of events do not know which components will be affected
by those events.
</p>

<p>
Components cannot make assumptions about the order of processing.
</p>

<p>
Components cannot make assumptions about what processing will occur
as a result of their events (perhaps no component responds).
</p>

<p>
<span class="underline">Advantages</span>:
</p>
<ul class="org-ul">
<li>strong support for reuse since any component can be introduced
into a system simply by registering it for the event of
that system</li>
<li>eases system evolution since components may be replaced without
affecting interfaces of other components in the system</li>
</ul>

<p>
<span class="underline">Disadvantages</span>:
</p>
<ul class="org-ul">
<li>when component announces events
<ul class="org-ul">
<li>unknown what components will respond</li>
<li>unknown order of responses</li>
<li>unknown when responses are finished</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgbcffefd" class="outline-4">
<h4 id="orgbcffefd"><span class="section-number-4">2.9.1.</span> Specializations</h4>
<div class="outline-text-4" id="text-2-9-1">
<p>
Often connectors include the traditional procedure call in addition to
bindings between event announcements and procedure calls.
</p>
</div>
</div>
</div>
