3B/SE464/14-Architecture-Styles.html
<div id="outline-container-org1b4dbcf" class="outline-3">
<h3 id="org1b4dbcf"><span class="section-number-3">2.10.</span> Event Driven Architecture</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Architecture style that orchestrates behaviour around events.
</p>

<p>
Has event producers and consumers.
Events come as significant state changes.
</p>

<p>
Focuses on event production, detection, and consumption.
</p>

<p>
Asynchronous communication (implicit invocation may be sync).
</p>

<p>
Event producers and consumer are decoupled.
</p>

<p>
Useful for real-time data processing, distributed systems, and
complex event processing.
</p>

<p>
<span class="underline">Advantages</span>:
</p>
<ul class="org-ul">
<li>scalability
<ul class="org-ul">
<li>handles fluctuating loads</li>
</ul></li>
<li>flexibility
<ul class="org-ul">
<li>easy to add/remove components</li>
</ul></li>
<li>responsiveness
<ul class="org-ul">
<li>real-time reaction to events</li>
</ul></li>
<li>resilience
<ul class="org-ul">
<li>reduces impact of single component failure</li>
</ul></li>
<li>maintainability
<ul class="org-ul">
<li>simplifies maintenance and upgrades</li>
</ul></li>
<li>improves UX
<ul class="org-ul">
<li>faster and more interactive applications</li>
</ul></li>
</ul>

<p>
<span class="underline">Disadvantages</span>:
</p>
<ul class="org-ul">
<li>event consistency
<ul class="org-ul">
<li>reliability and ordering</li>
</ul></li>
<li>complexity in event handling</li>
<li>integration with legacy systems</li>
<li>event granularity
<ul class="org-ul">
<li>balance event size and information</li>
</ul></li>
<li>event processing logic
<ul class="org-ul">
<li>distributing logic between producers and consumers</li>
</ul></li>
<li>error handling and recovery</li>
<li>monitoring and debugging
<ul class="org-ul">
<li>tracing event flows</li>
</ul></li>
<li>security concerns
<ul class="org-ul">
<li>protecting event data in transit and at rest</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org8a52e1f" class="outline-4">
<h4 id="org8a52e1f"><span class="section-number-4">2.10.1.</span> Publisher-Subscriber</h4>
<div class="outline-text-4" id="text-2-10-1">
<p>
Enables applications to announce events asynchronously.
Avoids coupling between sender and receivers.
</p>

<p>
<span class="underline">Disadvantages</span>:
</p>
<ul class="org-ul">
<li>need in distributed systems
<ul class="org-ul">
<li>components provide info to others as events occur</li>
</ul></li>
<li>advantages of async
<ul class="org-ul">
<li>decouple senders from consumers</li>
<li>prevents sender blockage waiting for responses</li>
</ul></li>
<li>scaling challenges
<ul class="org-ul">
<li>inefficiency with dedicated message queues</li>
<li>address varying consumer interests in event info</li>
</ul></li>
<li>how to announce events to interested consumers
without knowing identities</li>
</ul>
</div>
</div>
<div id="outline-container-orgee4a316" class="outline-4">
<h4 id="orgee4a316"><span class="section-number-4">2.10.2.</span> Asynchronous Messaging Subsystem</h4>
<div class="outline-text-4" id="text-2-10-2">
<p>
<span class="underline">Components</span>:
</p>
<ul class="org-ul">
<li>input messaging channel for sender (publisher)</li>
<li>output messaging channel per consumer (subscriber)</li>
<li>intermediary for message distribution (message broker/event bus)</li>
</ul>

<p>
<b>Message</b>: packet of data
</p>

<p>
<b>Event</b>: message indicating change or action
</p>

<p>
<span class="underline">Advantages</span>:
</p>
<ul class="org-ul">
<li>subsystem decoupling</li>
<li>enhanced scalability and sender responsiveness</li>
<li>reliability improvements</li>
<li>deferred or scheduled processing</li>
<li>integration across diverse systems</li>
<li>workflow facilitation and testing</li>
<li>separation of concerns</li>
</ul>

<p>
To implement, consider choice of technology (existing messaging products),
subscription handling (messaging infrastructure), and security measures
(policies to restrict channel access).
</p>

<p>
To handle message subsets, use topics for dedicated output channels with
content filtering based on message content.
Allow wildcard subscribers for multiple topics.
</p>

<p>
Bi-directional communication using request/reply pattern for acknowledgments
or status communication.
</p>

<p>
Design for idempotent message processing, since no guarantee of message
reception order.
</p>

<p>
Implement priority queue pattern for ordered message processing.
</p>

<p>
To deal with poison messages, prevent return to queue and store separately
for analysis.
Also use dead-letter queue functionality in message brokers, storing
unsuccessful messages.
</p>

<p>
Implement duplicate message detection and removal, and ensure
idempotent processing if infrastructure doesn&rsquo;t de-duplicate.
</p>

<p>
Implement limited lifetime for messages with expiration time in message data.
</p>

<p>
Enable embargo on messages until specific date/time, by restricting receiver
access until specified processing time.
</p>

<p>
Use for broad info broadcasting, cross-platform communication, and
non-real-time communication.
</p>

<p>
Requires support for eventual consistency and varied consumer
availability (different uptime schedules).
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-12-11 Wed 05:11</p>
</div>
</body>
</html>
